In [15]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from env import get_db_url

In [41]:
def get_data(sql_db, query):
    url = get_db_url(sql_db)

    df = pd.read_sql(query, url)
    df.to_csv(f'{sql_db}.csv')

    return df

In [42]:
def clean_data(df):
    return df

In [53]:
def wrangle_zillow():
    sql_db = "zillow"
    query = '''
            SELECT
                bedroomcnt,
                bathroomcnt,
                calculatedfinishedsquarefeet,
                taxvaluedollarcnt,
                yearbuilt,
                taxamount,
                fips,
                propertylandusedesc
            FROM
                properties_2017
            LEFT JOIN propertylandusetype USING (propertylandusetypeid)
            LEFT JOIN storytype USING (storytypeid)
            LEFT JOIN typeconstructiontype USING (typeconstructiontypeid)
            LEFT JOIN heatingorsystemtype USING (heatingorsystemtypeid)
            LEFT JOIN buildingclasstype USING (buildingclasstypeid)
            LEFT JOIN architecturalstyletype USING (architecturalstyletypeid)
            LEFT JOIN airconditioningtype USING (airconditioningtypeid);
            '''
    df=get_data(sql_db,query)
    return df

<hr style="border:2px solid gray">

In [54]:
df=get_data(sql_db,sql_query)

In [55]:
df.head(3).T

                                   0        1           2
bedroomcnt                       0.0      0.0        0.00
bathroomcnt                      0.0      0.0        0.00
calculatedfinishedsquarefeet     NaN      NaN    73026.00
taxvaluedollarcnt                9.0  27516.0  1434941.00
yearbuilt                        NaN      NaN     1959.00
taxamount                        NaN      NaN    20800.37
fips                          6037.0   6037.0     6037.00